Autodesk.Navisworks.Api.Data.DatabaseActionType
Enumeration of database edit.

Autodesk.Navisworks.Api.Data.DatabaseActionType.Do
A normal database edit

Autodesk.Navisworks.Api.Data.DatabaseActionType.Redo
A redo database edit

Autodesk.Navisworks.Api.Data.DatabaseActionType.Undo
An undo database edit